[
  {
    "title": "Pork Tenderloin with Garlic and Rosemary",
    "url_title": "pork-tenderloin-with-garlic-and-rosemary",
    "servings": 4,
    "description": "",
    "ingredients": [
      "1 pound pork tenderloin",
      "1 clove garlic, sliced into 4 pieces",
      "4 sprigs rosemary",
      "1 tablespoon grape-seed or other high temperature frying oil",
      "1/2 cup dry white wine",
      "salt and pepper to taste",
      "large oven safe pan"
    ],
    "directions": [
      "Preheat oven to 425º",
      "Make 4 slits in pork with a sharp knife, put 1 slice of garlic and 1 sprig of rosemary in each slit",
      "Heat large, oven safe pan over medium heat. Add oil and brown tenderloin on all sides",
      "Add salt and pepper, place pan on lower over rack and roast for 10 minutes",
      "Remove from oven, add wine, and roast for an additional 10-15 minutes, turning a couple more times",
      "Remove and let rest for 10 minutes before slicing"
    ]
  },
  {
    "title": "Nonna's Tomato Sauce",
    "url_title": "nonnas-tomato-sauce",
    "servings": "4-6",
    "description": "This is a variation of a standard red sauce that was my Roman grandmother's recipe",
    "ingredients": [
      "1/2 cup olive oil",
      "chicken neck and giblets",
      "1 medium yellow onion, chopped",
      "1 stalk celery, cut in half",
      "1 carrot, cut in half",
      "4 tablespoons Italian parsley, chopped",
      "1 Knorr chicken bouillon cube",
      "3-4 fresh sweet basil leaves",
      "1 28 ounce can roma tomatoes",
      "Salt and pepper to taste",
      "1/2 cup parmesan cheese, grated",
      "1 pound pasta"
    ],
    "directions": [
      "Sauté chicken parts in olive oil, add onion, celery, carrot and parsley",
      "Add tomatoes, bouillon cube, basil, salt and pepper",
      "Cook at a rapid simmer, stirring occasionally, for about 30 minutes",
      "Remove chicken, celery and carrot from sauce",
      "Cook pasta in salted water al dente",
      "Serve with grated parmesan cheese"
    ]
  },
  {
    "title": "Sugo Bolognese (Ragu)",
    "url_title": "sugo-bolognese-ragu",
    "servings": "4-6",
    "description": "",
    "ingredients": [
      "1 pound ground beef",
      "2 ounces prosciutto, finely chopped",
      "1 28 ounce can roma tomatoes",
      "1 medium yellow onion, finely chopped",
      "1 carrot, finely chopped",
      "1 celery stalk (including leaves), finely chopped",
      "1 cup dry red wine",
      "1/2 cup cream",
      "1 Knorr chicken bouillon cube",
      "2 cloves garlic, sliced",
      "2 tablespoons olive oil",
      "1 teaspoon salt",
      "1/2 teaspoon pepper",
      "1/2 cup parmesan cheese, grated",
      "1 pound pasta"
    ],
    "directions": [
      "Sauté prosciutto in olive oil until it melts",
      "Add onion, carrot and celery",
      "When mixture gets a light golden color, add meat, breaking it up with a fork",
      "Continue to cook, stirring frequently, until it loses it's pink color",
      "Add garlic and wine",
      "Cook about 10-15 minutes at a brisk heat until wine alcohol evaporates",
      "Lower heat and add cream",
      "Cook gently until cream practically disappears",
      "Add salt, pepper, bouillon cube and tomatoes",
      "Cool gently for about 1 hour, stirring occasionally",
      "Cook pasta in salted water al dente",
      "Serve with grated parmesan cheese"
    ]
  },
  {
    "title": "Pasta alla Vongole (Pasta with Clam Sauce)",
    "url_title": "pasta-alla-vongole-pasta-with-clam-sauce",
    "servings": "4-6",
    "description": "",
    "ingredients": [
      "Kosher salt",
      "4 tablespoons extra-virgin olive oil",
      "4 medium garlic cloves, 2 smashed and left whole, 2 finely sliced",
      "1/2 teaspoon red pepper flakes",
      "1/2 cup dry white wine",
      "2 tablespoons butter",
      "2 pounds littleneck clams",
      "1 pound linguini",
      "1/4 cup fresh parsley, chopped",
      "2 teaspoons grated lemon zest",
      "1 tablespoon fresh lemon juice",
      "freshly ground black pepper"
    ],
    "directions": [
      "Heat the oil and the 2 smashed garlic cloves in a large saucepan over medium-high heat until the garlic is gently sizzling. Reduce heat to medium-low and sizzle until garlic is golden brown, about 5 to 7 minutes",
      "Discard the garlic cloves and return the pan to medium-high heat. Add the sliced garlic and pepper flakes and cook, stirring, until the garlic just starts to turn pale golden brown, about 45 seconds (be careful not to burn)",
      "Add the wine, butter, and clams. Cover and cook, shaking the pan occasionally, until the clams open, about 5 minutes. Transfer the clams to a bowl and set the sauce aside",
      "Cook the pasta al dente in salted water. When draining the pasta, reserve 1/2 cup of the liquid, then return the pasta to the pot set over medium-low heat",
      "Pour the sauce and half of the reserved pasta water over the pasta and mix until coated, about 2 minutes, adding more reserved liquid as necessary until the desired consistency is reached",
      "Stir in the clams, parsley, and lemon zest and juice, and season to taste with salt and pepper"
    ]
  },
  {
    "title": "Suppli",
    "url_title": "suppli",
    "servings": "10",
    "description": "",
    "ingredients": [
      "4 cups left over risotto (mushroom, tomato, or bianco)",
      "1/2 cup parmesan cheese, grated",
      "1 egg, beaten",
      "1/2 pound mozzarella cheese cut into 1/2 x 1/4 inch sticks",
      "1 cup panko breadcrumbs",
      "Canola or peanut oil for deep frying"
    ],
    "directions": [
      "Mix together risotto, egg, parmesan cheese, and 1/2 of the breadcrumbs",
      "Shape into an oblong croquette by spreading 1 tablespoon of the risotto mixture in the palm of your hand. In the center place a piece of mozzarella cheese",
      "Cover with another tablespoon of the risotto mixture and form into a croquette",
      "Roll in the remaining breadcrumbs",
      "Refrigerate at least 1 hour before deep frying",
      "Deep fry for 2-3 minutes, until the outside reaches a deep golden brown, and drain on paper towels"
    ]
  },
  {
    "title": "Cannelloni",
    "url_title": "cannelloni",
    "servings": "10",
    "description": "",
    "ingredients": [
      "1 pound ricotta cheese",
      "1 package fresh spinach (optional)",
      "1/2 pound mozzarella cheese, grated",
      "1 cup parmesan cheese, grated",
      "1 egg, beaten",
      "1 package lasagna noodles",
      "3 cups tomato sauce"
    ],
    "directions": [
      "Mix together ricotta, egg, mozzarella, and 1/2 cup of the parmesan. If using spinach, cook gently in a pan until wilted, drain and squeeze out all liquid, and add to the mixture",
      "Boil pasta in salted water until al dente and drain",
      "Put some sauce in the bottom of a 9x13 inch pan",
      "Put a large tablespoon of cheese mixture on each pasta sheet and roll",
      "Place each roll in the pan, seam side down, cover with sauce, and sprinkle with additional parmesan",
      "Bake at 350º for about 30 minutes",
      "At this point you can freeze them"
    ]
  },
  {
    "title": "Sherry Lemon Vinaigrette",
    "url_title": "sherry-lemon-vinaigrette",
    "servings": "4",
    "description": "",
    "ingredients": [
      "3 tablespoons extra virgin olive oil",
      "1/2 tablespoon sherry vinegar",
      "1/2 tablespoon lemon juice",
      "1/2 teaspoon Dijon mustard",
      "1/4 teaspoon sea salt",
      "1/4 teaspoon fresh ground pepper"
    ],
    "directions": [
      "Mix all ingredients together and dress salad or vegetables"
    ]
  },
  {
    "title": "Pasta con Pomodori Arrostiti (Pasta with Roasted Tomatoes)",
    "url_title": "pasta-con-pomodori-arrostiti",
    "servings": "4-6",
    "description": "",
    "ingredients": [
      "1/2 cup olive oil",
      "2 large tomatoes, diced",
      "10 clover of garlic, 4 smashed, 2 minced, 2 chopped",
      "1/2 teaspoon red pepper flakes",
      "1/4 cup fresh parsley, chopped, stems reserved",
      "3 tablespoons butter",
      "1/2 cup dry red wine",
      "1 pound linguini or spaghetti",
      "1/2 cup parmesan cheese, grated"
    ],
    "directions": [
      "Preheat oven to 450º",
      "Place diced tomatoes, 2 cloves of chopped garlic, and parsley stems on baking sheet. Drizzle with olive oil and season lightly with salt and pepper. Roast until tomatoes have a slight char, about 8-10 minutes. Remove from oven and place tomatoes to the side, preserving brown bits from the bottom of the baking pan but discarding garlic and parsley stems",
      "Heat the oil and the 4 smashed garlic cloves in a large saucepan over medium-high heat until the garlic is gently sizzling. Reduce heat to medium-low and sizzle until garlic is golden brown, about 5 to 7 minutes",
      "Discard the garlic cloves and return the pan to medium-high heat. Add the minced garlic and pepper flakes and cook, stirring, until the garlic just starts to turn pale golden brown, about 45 seconds (be careful not to burn)", 
      "Add the tomato mixture and cook an additional 1 minute",
      "Add the red wine and cook until alcohol is evaporated, about 1 minute longer",
      "Remove from heat and add butter, stirring until melted. Taste, and season with additional salt if necessary. Set sauce aside",
      "Cook pasta al dente in well salted water and drain, reserving 1/2 cup of the pasta water",
      "Return pasta to the pot, add tomato sauce, chopped parsley, half of the reserved pasta water, and cheese and stir until pasta is coated. Add additional pasta water as needed until desired consistency is reached"
    ]
  },
  {
    "title": "Chicken Cacciatore",
    "url_title": "chicken-cacciatore",
    "servings": "8",
    "description": "",
    "ingredients": [
      "8 chicken thighs, bone-in with skin removed",
      "1/2 cup flour",
      "3 tablespoons olive oil",
      "3 tablespoons butter",
      "1 cup onion, chopped",
      "1 cup carrot, chopped",
      "1/2 cup celery, chopped",
      "1 Knorr chicken bouillon cube",
      "1 cup dry white wine",
      "3-4 crushed Roma tomatoes",
      "1/4 cup fresh parsley, chopped",
      "3-4 fresh sweet basil leaves",
      "salt and pepper to taste"
    ],
    "directions": [
      "Remove skin from chicken thighs, salt and pepper both sides",
      "Dredge in flour, and brown both sides in olive oil and butter in a large frying pan on medium heat",
      "Carefully remove chicken from pan and set aside",
      "Add onions, carrot, celery and sauté until tender",
      "Add wine to de-glaze the pan, and reduce until half of the wine is gone",
      "Add tomatoes, bouillon cube and basil",
      "Return the chicken to the pan, reduce heat and simmer about 45 minutes turning frequently. If chicken becomes dry add some water",
      "Before serving, stir in chopped parsley"
    ]
  }
]
